import './Services.scss'
import { ServicesCard } from '../Services-card/Services-card'

const services = [
    {
        id: 1, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'Cайт-визитка',
        description: 'Яркие и лаконичные сайты для презентации вашего бизнеса, портфолио или услуг.',
        quote: 'Покажите клиентам, чем вы уникальны',
    },
    {
        id: 2, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'Адаптивная вёрстка',
        description: 'Сайты, которые идеально отображаются на любых устройствах: смартфонах, планшетах и компьютерах.',
        quote: 'Клиенты увидят Вас с лучшей стороны',
    },
    {
        id: 3, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'Лендинги для рекламы',
        description: 'Одностраничные сайты, которые превращают посетителей в покупателей. Быстро, ярко, эффективно.',
        quote: 'Больше заявок за 48 часов',
    },
    {
        id: 4, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'Анимированные элементы',
        description: 'Динамичные кнопки, плавные переходы и hover-эффекты для вовлечения пользователей.',
        quote: 'Делаю сайт живым и запоминающимся',
    },
    {
        id: 5, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'Редизайн устаревших сайтов',
        description: 'Современный дизайн и функционал для сайтов, которые потеряли актуальность.',
        quote: 'Вдохну новую жизнь в Ваш ресурс',
    },
    {
        id: 6, 
        image: <svg width="59" height="57" fill="none"><path fill="#FD6F00" fillRule="evenodd" d="M22 36c10 0 22 1 22 10 0 10-14 10-21 10h-2c-7 0-21 0-21-10s15-10 21-10h1Zm0 4c-8 0-17 1-17 6 0 4 6 6 17 6 12 0 18-2 18-6s-6-6-18-6Zm27-6c8 2 9 5 9 8 0 2 0 5-5 7a2 2 0 1 1-1-4c2-1 2-2 2-3 0-2-2-3-6-3l-2-3 3-2ZM22 1a15 15 0 0 1 0 30 15 15 0 0 1 0-30Zm21 3c6 1 10 6 10 12a12 12 0 0 1-11 11 2 2 0 0 1 0-4c4 0 6-4 6-7 0-4-2-7-6-8a2 2 0 0 1 1-4ZM22 5a11 11 0 0 0 0 21 10 10 0 0 0 11-10c0-6-5-11-11-11Z" clipRule="evenodd"/></svg>,
        title: 'SEO-оптимизация',
        description: 'Настройка метатегов, структуры сайта и контента для продвижения в поисковых системах.',
        quote: 'Ваш сайт — в топе Google и Яндекс',
    }
]

export const Services = () => {

    return (
        <section className="services" id='services'>
            <h2 className="services__title">Услуги</h2>
            <p className="services__subtitle h6">Цифровые решения для Вашего успеха: от концепции до реализации</p>
            <div className="services__cards">
                {services.map((service) => (
                    <ServicesCard 
                        key={service.id} 
                        image={service.image} 
                        title={service.title} 
                        description={service.description} 
                        quote={service.quote}
                    />
                ))}
            </div>
        </section>
    )
}