import './AboutMe.scss'
import hero from '../../Images/hero-wrapper.jpg'
import { CircularProgress } from '../CircularProgress/CircularProgress'
import { scrollToSection } from '../../utils/scroll'

const technologies = [
    {
        id: 1,
        category: 'HTML, CSS',
        percentage: 100,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="38" height="53" fill="none"><path fill="#959595" fillRule="evenodd" d="M20.88 34.459a10.028 10.028 0 0 0 15.536-11.671 10.028 10.028 0 0 0-3.415-4.311 10.02 10.02 0 0 0 4.182-8.15A10.031 10.031 0 0 0 27.153.296h-16.3a10.03 10.03 0 0 0-5.851 18.18 10.03 10.03 0 0 0 0 16.301 10.03 10.03 0 1 0 15.879 8.15V34.46ZM10.85 4.058a6.27 6.27 0 0 0 0 12.538h6.27V4.058h-6.27Zm6.27 32.6h-6.27a6.269 6.269 0 1 0 6.27 6.27v-6.27Zm-6.27-16.3a6.27 6.27 0 0 0 0 12.538h6.27V20.358h-6.27Zm10.03 6.269a6.27 6.27 0 1 0 12.541 0 6.27 6.27 0 0 0-12.54 0Zm6.27-10.03a6.27 6.27 0 1 0 0-12.54h-6.27v12.54h6.27Z" clipRule="evenodd"/></svg>
    },
    {
        id: 2,
        category: 'JavaScript',
        percentage: 80,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="38" height="53" fill="none"><path fill="#959595" fillRule="evenodd" d="M20.88 34.459a10.028 10.028 0 0 0 15.536-11.671 10.028 10.028 0 0 0-3.415-4.311 10.02 10.02 0 0 0 4.182-8.15A10.031 10.031 0 0 0 27.153.296h-16.3a10.03 10.03 0 0 0-5.851 18.18 10.03 10.03 0 0 0 0 16.301 10.03 10.03 0 1 0 15.879 8.15V34.46ZM10.85 4.058a6.27 6.27 0 0 0 0 12.538h6.27V4.058h-6.27Zm6.27 32.6h-6.27a6.269 6.269 0 1 0 6.27 6.27v-6.27Zm-6.27-16.3a6.27 6.27 0 0 0 0 12.538h6.27V20.358h-6.27Zm10.03 6.269a6.27 6.27 0 1 0 12.541 0 6.27 6.27 0 0 0-12.54 0Zm6.27-10.03a6.27 6.27 0 1 0 0-12.54h-6.27v12.54h6.27Z" clipRule="evenodd"/></svg>
    },
    {
        id: 3,
        category: 'TypeScript',
        percentage: 80,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="38" height="53" fill="none"><path fill="#959595" fillRule="evenodd" d="M20.88 34.459a10.028 10.028 0 0 0 15.536-11.671 10.028 10.028 0 0 0-3.415-4.311 10.02 10.02 0 0 0 4.182-8.15A10.031 10.031 0 0 0 27.153.296h-16.3a10.03 10.03 0 0 0-5.851 18.18 10.03 10.03 0 0 0 0 16.301 10.03 10.03 0 1 0 15.879 8.15V34.46ZM10.85 4.058a6.27 6.27 0 0 0 0 12.538h6.27V4.058h-6.27Zm6.27 32.6h-6.27a6.269 6.269 0 1 0 6.27 6.27v-6.27Zm-6.27-16.3a6.27 6.27 0 0 0 0 12.538h6.27V20.358h-6.27Zm10.03 6.269a6.27 6.27 0 1 0 12.541 0 6.27 6.27 0 0 0-12.54 0Zm6.27-10.03a6.27 6.27 0 1 0 0-12.54h-6.27v12.54h6.27Z" clipRule="evenodd"/></svg>
    },
    {
        id: 4,
        category: 'React',
        percentage: 70,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="38" height="53" fill="none"><path fill="#959595" fillRule="evenodd" d="M20.88 34.459a10.028 10.028 0 0 0 15.536-11.671 10.028 10.028 0 0 0-3.415-4.311 10.02 10.02 0 0 0 4.182-8.15A10.031 10.031 0 0 0 27.153.296h-16.3a10.03 10.03 0 0 0-5.851 18.18 10.03 10.03 0 0 0 0 16.301 10.03 10.03 0 1 0 15.879 8.15V34.46ZM10.85 4.058a6.27 6.27 0 0 0 0 12.538h6.27V4.058h-6.27Zm6.27 32.6h-6.27a6.269 6.269 0 1 0 6.27 6.27v-6.27Zm-6.27-16.3a6.27 6.27 0 0 0 0 12.538h6.27V20.358h-6.27Zm10.03 6.269a6.27 6.27 0 1 0 12.541 0 6.27 6.27 0 0 0-12.54 0Zm6.27-10.03a6.27 6.27 0 1 0 0-12.54h-6.27v12.54h6.27Z" clipRule="evenodd"/></svg>
    },
    {
        id: 5,
        category: 'CMS',
        percentage: 70,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="38" height="53" fill="none"><path fill="#959595" fillRule="evenodd" d="M20.88 34.459a10.028 10.028 0 0 0 15.536-11.671 10.028 10.028 0 0 0-3.415-4.311 10.02 10.02 0 0 0 4.182-8.15A10.031 10.031 0 0 0 27.153.296h-16.3a10.03 10.03 0 0 0-5.851 18.18 10.03 10.03 0 0 0 0 16.301 10.03 10.03 0 1 0 15.879 8.15V34.46ZM10.85 4.058a6.27 6.27 0 0 0 0 12.538h6.27V4.058h-6.27Zm6.27 32.6h-6.27a6.269 6.269 0 1 0 6.27 6.27v-6.27Zm-6.27-16.3a6.27 6.27 0 0 0 0 12.538h6.27V20.358h-6.27Zm10.03 6.269a6.27 6.27 0 1 0 12.541 0 6.27 6.27 0 0 0-12.54 0Zm6.27-10.03a6.27 6.27 0 1 0 0-12.54h-6.27v12.54h6.27Z" clipRule="evenodd"/></svg>
    },
]

export const AboutMe = () => {

    return (
        <section className='about-me' id='about-me'>
            <h2 className="about-me__title">Обо мне</h2>
            <p className="h6 about-me__subtitle">«Каждый проект — это новая история, которую я создаю вместе с вами»</p>
            <div className="about-me__info">
                <img className="about-me__image"
                    src={hero} 
                    alt="" 
                    width='618' 
                    height='781' 
                    loading='lazy'
                />
                <div className='about-me__content'>
                    <p className=' h6 about-me__description'>
                        <span>
                            Приветствую! <br/> 
                            Меня зовут Евгений, и я увлечённый профессионал в сфере веб-разработки. За плечами более двух лет опыта создания современных веб-приложений, в течение которых я успешно совмещал работу как в команде, так и над собственными проектами.
                            Моя экспертиза охватывает широкий спектр технологий: от фронтенд-разработки до создания полноценных веб-приложений с использованием современных фреймворков. Особое внимание уделяю качеству кода и пользовательскому опыту, что позволяет создавать продукты, отвечающие самым высоким стандартам. 
                        </span>
                        <span>
                            Моя главная цель — создавать цифровые продукты, которые не только выглядят привлекательно, но и приносят реальную пользу пользователям. Я верю, что каждый проект — это возможность сделать интернет-пространство лучше и удобнее для всех.
                        </span>
                    </p>
                    <button onClick={() => scrollToSection('contacts')} className='about-me__button'>Связаться</button>
                </div>
            </div>
            <div className='about-me__skills' id='skills'>
                {technologies.map((tech) => (
                    <CircularProgress percentage={tech.percentage} category={tech.category} key={tech.id}>
                        {tech.icon}
                    </CircularProgress>
                ))}
            </div>

        </section>
    )
}